{
  "architectures": [
    "LxmertModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 128,
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "l_layers": 9,
  "layer_norm_eps": 1e-12,
  "model_type": "lxmert",
  "gcn": false,
  "num_attention_heads": 8,
  "r_layers": 5,
  "task_mask_lm": true,
  "task_mask_kg": true,
  "max_position_embeddings": {"lang": 512,"kg": 0},
  "vocab_size": {"lang": 30522, "kg": 2901117},
  "type_vocab_size": {"lang": 2,"kg": 0},
  "kg_pad_idx": 0,
  "kg_mask_idx": 1,
  "x_layers": 5
}