{
  "architectures": [
    "LxmertModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "l_layers": 4,
  "r_layers": 4,
  "x_layers": 4,
  "layer_norm_eps": 1e-12,
  "model_type": "lxmert",
  "gcn": false,
  "num_attention_heads": 4,
  "task_mask_lm": true,
  "task_mask_kg": true,
  "contrastive_learning": false,
  "structured_cross": false,
  "negative_samples": 0,
  "max_position_embeddings": {"lang": 512,"kg": 1024},
  "vocab_size": {"lang": 30522, "kg": 7871},
  "type_vocab_size": {"lang": 2,"kg": 0},
  "num_kg_labels":7871,
  "num_relations": 7,
  "kg_special_token_ids":{"PAD":0,"MASK":1, "CLS":2},
  "pretrained_kg_embedding": "",
  "pretrained_lang_model": {"use_weight": false, "model_name": "prajjwal1/bert-mini"}
}