{
  "architectures": [
    "LxmertModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 128,
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "l_layers": 2,
  "r_layers": 2,
  "x_layers": 4,
  "layer_norm_eps": 1e-12,
  "model_type": "lxmert",
  "gcn": true,
  "num_attention_heads": 8,
  "task_mask_lm": true,
  "task_mask_kg": true,
  "contrastive_learning": false,
  "negative_samples": 0,
  "max_position_embeddings": {"lang": 512,"kg": 0},
  "vocab_size": {"lang": 30522, "kg": 3015345},
  "type_vocab_size": {"lang": 2,"kg": 0},
  "num_kg_labels": 9169,
  "num_relations": 8,
  "kg_special_token_ids":{"PAD":0,"MASK":1, "CLS":2},
  "pretrained_kg_embedding": "",
  "pretrained_lang_model": {"use_weight": true, "model_name": "prajjwal1/bert-tiny"}
}