{
  "architectures": [
    "LxmertModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 128,
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "l_layers": 9,
  "layer_norm_eps": 1e-12,
  "model_type": "lxmert",
  "gcn": false,
  "num_attention_heads": 2,
  "num_attr_labels": 400,
  "num_object_labels": 1600,
  "num_qa_labels": 9500,
  "r_layers": 5,
  "task_mask_lm": true,
  "task_mask_kg": true,
  "task_matched": true,
  "task_obj_predict": true,
  "task_qa": true,
  "visual_attr_loss": true,
  "visual_feat_dim": 2048,
  "visual_feat_loss": true,
  "visual_loss_normalizer": 6.67,
  "visual_obj_loss": true,
  "visual_pos_dim": 4,
  "max_position_embeddings": {"lang": 512,"kg": 0},
  "vocab_size": {"lang": 30522, "kg": 9104},
  "type_vocab_size": {"lang": 2,"kg": 0},
  "kg_pad_idx": 0,
  "kg_mask_idx": 1,
  "x_layers": 5
}